#日期时间类型
#创建表格
create table t_time(
	y year,
	d date,
	t time,
	dt datetime,
	ts timestamp
);

#查看表结构
desc t_time;

mysql> desc t_time;
+-------+-----------+------+-----+---------+-------+
| Field | Type      | Null | Key | Default | Extra |
+-------+-----------+------+-----+---------+-------+
| y     | year      | YES  |     | NULL    |       |
| d     | date      | YES  |     | NULL    |       |
| t     | time      | YES  |     | NULL    |       |
| dt    | datetime  | YES  |     | NULL    |       |
| ts    | timestamp | YES  |     | NULL    |       |
+-------+-----------+------+-----+---------+-------+
5 rows in set (0.01 sec)


#添加数据
insert into t_time
values('2021','2021-11-29','14:07:15','2021-11-29 14:07:15','2021-11-29 14:07:15');


#查询数据
select * from t_time;
mysql> select * from t_time;
+------+------------+----------+---------------------+---------------------+
| y    | d          | t        | dt                  | ts                  |
+------+------------+----------+---------------------+---------------------+
| 2021 | 2021-11-29 | 14:07:15 | 2021-11-29 14:07:15 | 2021-11-29 14:07:15 |
+------+------------+----------+---------------------+---------------------+
1 row in set (0.00 sec)


#添加数据
insert into t_time
values(2021,2021-11-29,14:07:15,2021-11-29 14:07:15,2021-11-29 14:07:15);

mysql> insert into t_time
    -> values(2021,2021-11-29,14:07:15,2021-11-29 14:07:15,2021-11-29 14:07:15);
ERROR 1064 (42000): You have an error in your SQL syntax;
check the manual that corresponds to your MySQL server version 
for the right syntax to use near ':07:15,2021-11-29 14:07:15,2021-11-29 14:07:15)' at line 2

#添加数据
insert into t_time
values(2021,2021-11-29,'14:07:15','2021-11-29 14:07:15','2021-11-29 14:07:15');

#d字段添加时，把2021-11-29识别为表达式 求减法

#添加数据
insert into t_time
values(2021,'2021-11-29','14:07:15','2021-11-29 14:07:15','2021-11-29 14:07:15');


#查询数据
select * from t_time;

#YEAR还有格式为“YY”2位数字的形式，
#值是00~69，表示2000~2069年，值是70~99，表示1970~1999年
#添加数据
insert into t_time
values(21,'2021-11-29','14:07:15','2021-11-29 14:07:15','2021-11-29 14:07:15');

insert into t_time
values(89,'2021-11-29','14:07:15','2021-11-29 14:07:15','2021-11-29 14:07:15');

insert into t_time
values(0,'2021-11-29','14:07:15','2021-11-29 14:07:15','2021-11-29 14:07:15');

insert into t_time
values(00,'2021-11-29','14:07:15','2021-11-29 14:07:15','2021-11-29 14:07:15');

insert into t_time
values('00','2021-11-29','14:07:15','2021-11-29 14:07:15','2021-11-29 14:07:15');

总结：日期时间包括年份，最好加上单引号。
对于年份来说虽然目前还是支持2位数的年份，
但是建议大家用标准的4位数表示年份。
